app/controllers/scores_controller.rb

SELECT "scores".* FROM "scores"
---
  def index
    @scores = Score.all

INSERT INTO "scores" ("subject", "point", "grade", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["subject", "cem2"], ["point", 1], ["grade", "F-"], ["student_id", 1], ["created_at", "2022-10-19 09:07:21.066778"], ["updated_at", "2022-10-19 09:07:21.066778"]]
---
  def create
    @score = Score.new(score_params)

    respond_to do |format|
      if @score.save

UPDATE "scores" SET "point" = ?, "grade" = ?, "updated_at" = ? WHERE "scores"."id" = ?  [["point", 10000], ["grade", "S"], ["updated_at", "2022-10-19 09:11:35.861821"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @score.update(score_params)

DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 1]]
---
  def destroy
    @score.destroy

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_score
      @score = Score.find(params[:id])