app/controllers/students_controller.rb

  def edit_score
    reset_session
    @id = params[:id].to_i
    @student = Student.find_by(id:@id)
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "dob", "student_no", "class_year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ble"], ["dob", "2022-09-14"], ["student_no", "1"], ["class_year", 3], ["created_at", "2022-09-22 06:37:11.150791"], ["updated_at", "2022-09-22 06:37:11.150791"]]